// Напишите программу, которая на вход принимает число и выдаёт его квадрат (число умноженное на само себя)

int number = 5;

//int numberResult = number * number;

double numberResult = Math.Pow(number, 3);

Console.WriteLine(numberResult);
